uhnp/src/Enums/ВидыКонтрагентовДляВГО/ВидыКонтрагентовДляВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрагентовДляВГО</name>
  <enumValues>
    <name>ВнутренниеКонтрагенты</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеКонтрагенты</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагентаДляВГО</name>
    <comment>(УХ)</comment>
    <type>
      <types>EnumRef.ВидыКонтрагентовДляВГО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизационнаяЕдиница</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаКонтрагента</name>
    <type>
      <types>CatalogRef.ГруппыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКОПФ</name>
    <comment>(УХ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОПФ</name>
    <comment>(УХ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <comment>Наименование в латинской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БИК</name>
    <comment>не используется (УХ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаУчастияВКапитале</name>
    <comment>(УХ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СубъектМалогоИлиСреднегоПредпринимательстваУХ</name>
    <comment>(УХ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПродаж</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.КаналыПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиНаУчетВНалоговой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресМеждународный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородСтранаМеждународный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_Актуализирован</name>
    <comment>//Федоров С 24.08.2021 Выполнение задач №000038809</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_АктуализированТП</name>
    <comment>//Федоров С 24.08.2021 Выполнение задач №000038809</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ДатаАктуализации</name>
    <comment>//Федоров С 24.08.2021 Выполнение задач №000038809</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ДатаАктуализацииТП</name>
    <comment>//Федоров С 24.08.2021 Выполнение задач №000038809</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ДатаУстановкиСостояния</name>
    <comment>//Федоров С 24.08.2021 Выполнение задач №000038809</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ПериодДействияАктуализации</name>
    <comment>//Федоров С 24.08.2021 Выполнение задач №000038809</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ПериодДействияАктуализацииТП</name>
    <comment>//Федоров С 24.08.2021 Выполнение задач №000038809</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_Статус</name>
    <comment>//Федоров С 24.08.2021 Выполнение задач №000038809</comment>
    <type>
      <types>EnumRef.тн_СтатусыКонтрагентовСПортала</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_Принадлежность</name>
    <comment>// Хоменко Вадим 20.10.2021 Выполнение задач №000039297</comment>
    <type>
      <types>CatalogRef.тн_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ДатаДокументаПодтверждающегоМестонахождениеВИностранномГосударстве</name>
    <comment>№000041949</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_НомерДокументаПодтверждающегоМестонахождениеВИностранномГосударстве</name>
    <comment>№000041949</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ПолноеНаименованиеВРусскойТранскрипции</name>
    <comment>№000041949</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ОснованиеПримененияПониженнойСтавки</name>
    <comment>№000041949</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ЯвляетсяОбъектомЦБ</name>
    <comment>Выполнение задач №000042800</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_РаботаетСЭД</name>
    <comment>// Шичкин Егор 15.12.2022 Выполнение задач №000043264</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ТерриториальнаяПринадлежность</name>
    <comment>// Гутарова Екатерина 11.09.2023 Выполнение задач №000046809</comment>
    <type>
      <types>CatalogRef.тн_РегионыПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВТранскрипции</name>
    <comment>Наименование в русской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>550</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ОтключитьКонтрольДатПокупкиБилета</name>
    <comment>// Юдина Екатерина 30.01.2025 Выполнение задач №000052453</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ЕКК</name>
    <comment>//Сафиуллина З.Р. 14.02.2025 Выполнение задач №000052637</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СокращенноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/РаботаСКонтрагентамиУХ/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ЭтоВнутригрупповойКонтрагент(Контрагент) Экспорт
	
	Результат = Ложь;
	
	ВидКонтрагентаДляВГО = Неопределено;
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВидКонтрагентаДляВГО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ВидКонтрагентаДляВГО");
	ИначеЕсли Контрагент <> Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контрагент, "ВидКонтрагентаДляВГО") Тогда
		ВидКонтрагентаДляВГО = Контрагент.ВидКонтрагентаДляВГО;
	КонецЕсли;
	
	Результат = (ВидКонтрагентаДляВГО = Перечисления.ВидыКонтрагентовДляВГО.ВнутренниеКонтрагенты);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоНерезидент(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СтранаРегистрации", Контрагент.Метаданные()) Тогда
		СтранаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "СтранаРегистрации");
		Возврат СтранаРегистрации <> Справочники.СтраныМира.Россия;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Функция возвращает контрагента, соответствующего искомой организации.
//
// Параметры:
//  Организация	 - 	СправочникСсылка.Организации - организация, для которой ищется соответствующий контрагент.
// 
// Возвращаемое значение:
//  СправочникСсылка.Контрагенты - найденный контрагент. Если контрагент не обнаружен, возвращается пустая ссылка.
//
Функция КонтрагентОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ОрганизационнаяЕдиница = &ОрганизационнаяЕдиница
		|	И НЕ Контрагенты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ОрганизационнаяЕдиница", Организация);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		
		Возврат Справочники.Контрагенты.ПустаяСсылка();
		
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
